import React from "react"

const indentationStyle = {
  marginLeft: "15px"
}

export const ContentForUsingGgabi = () => {
  return (
    <React.Fragment>

      <b><u>[제1장] 총칙</u></b> <br/>
      <b>제1조(목적)</b> <br/>
      이 약관은 그룹웨어 서비스(이하 “서비스”)를 제공하는 깨비 Corporate(이하 “깨비”)와 위 서비스를 
      이용하는 회사(이하 “회사”) 그리고 ‘회사’으로부터 이용 권한을 부여받는 사원(이하 “구성원”) 간에 
      서비스 이용에 관한 권리와 의무 및 책임 기타 제반 사항을 규정함을 목적으로 합니다. <br/><br/>

      <b>제2조(용어 정리)</b> <br/>
      1. ‘깨비 그룹웨어’라 함은 ‘깨비’가 ‘회사’에게 제공하는 메일, 달력, 연락처, SMS, 공지사항, 
      근태관리 등 일련의 관련 제반 서비스를 의미합니다. <br/>
      2. ‘회사’이라 함은 ‘깨비 그룹웨어’에 접속하여 본 약관에 따라 ‘깨비’와 이용계약을 체결하고 
      ‘깨비’가 제공하는 ‘서비스’를 이용하는 기관을 의미합니다. <br/>
      3. ‘구성원’이라 함은 ‘회사’으로부터 ‘깨비 그룹웨어’ 이용권한을 부여받아 ‘회사’의 관리하에 
      ‘깨비 그룹웨어’를 이용하는 자를 의미하며, ‘회사’로부터 부여받는 권한에 따라 ‘관리자’와 ‘일반 구성원’으로 구분됩니다. <br/>
      4. ‘관리자’는 ‘깨비 그룹웨어’의 ‘서비스’뿐만 아니라 모든 관리 기능을 이용할 수 있고, 
      ‘회사’를 대표하여 ‘깨비 그룹웨어’ 이용계약을 해지할 수 있는 ‘구성원’을 의미합니다. <br/>
      5. ‘일반 구성원’은 ‘깨비 그룹웨어’의 ‘서비스’만 이용할 수 있고 관리 기능은 이용할 수 없는 ‘구성원’을 의미합니다. <br/>
      6. ‘도메인(domain’이라 함은 ‘깨비 그룹웨어’ 이용을 위해 필요한 인터넷상의 주소를 말합니다. <br/>
      7. ‘아이디(ID)’라 함은 ‘구성원’의 식별 및 ‘깨비 그룹웨어’ 이용을 위해 필요한 특정 문자열과 
      ‘회사’가 정한 그룹명 또는 도메인의 조합을 의미합니다. <br/>
      8. ‘비밀번호’라 함은 같이 설정한 ‘아이디’와 일치되어 ‘구성원’임을 확인하는 특정 문자열을 의미합니다. <br/><br/>

      <b>제3조(약관의 게시와 개정)</b> <br/>
      1. 이 약관의 내용은 모든 ‘구성원’이 알 수 있도록 ‘깨비 그룹웨어’ 회원가입 페이지에 게시합니다. 
      또한 ‘깨비 그룹웨어’ 홈페이지 모든 화면 하단에 해당 약관을 볼 수 있는 링크를 게시합니다. <br/>
      2. ‘깨비’는 이 약관을 ‘구성원’이 전부를 쉽게 확인할 수 있도록 기술적 조치를 취합니다. <br/>
      3. ‘깨비’는 약관의 규제에 관한 법률, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 
      전자상거래 등에서의 소비자보호에 관한 법률, 전자문서 및 전자거래기본법, 전자금융거래법, 
      전자서명법 등 관련 법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다. <br/>
      4. ‘깨비’가 이 약관을 개정하고자 할 경우 적용일자 및 개정 사유를 함께 명시하여 개정된 
      약관을 적용일 7일 전부터 적용일 전날까지 공지합니다. 다만, ‘회원’에게 불리한 약관 개정의 
      경우에는 30일 전부터 공지를 진행하며 회원가입 시 입력한 이메일 주소와 ‘깨비 그룹웨어’ 메일 
      주소로 변경된 약관의 적용일자 및 개정 사유, 개정된 약관을 전달하여 ‘회사’에게 명확히 통지합니다. <br/>
      5. ‘깨비’의 개정 약관 통지에 대해 ‘회사’가 공지 기간 내에 명시적 거부 의사표시를 하지 
      않은 경우 약관 개정에 동의한 것으로 본다는 뜻을 명확하게 공지 또는 통지하였음에도 ‘회사’가 
      명시적으로 거부 의사표시를 하지 않은 경우 개정된 약관에 동의한 것으로 봅니다. <br/>
      6. ‘구성원’이 개정 약관의 적용에 동의하지 않은 경우 ‘깨비’는 개정 약관의 내용을 해당 
      ‘구성원’에게 적용할 수 없으며, ‘구성원’은 이용계약을 해지할 수 있습니다. <br/><br/>

      <b>제4조(이용계약 체결 등)</b> <br/>
      1. ‘깨비 그룹웨어’ 서비스 이용은 ‘일반 구성원’이 되고자 하는 자(이하 ‘가입신청자’)가 
      이 약관의 내용에 대해 동의를 한 다음 회원가입신청을 하고 ‘관리자’가 이러한 신청에 대해 승낙함으로써 체결됩니다. <br/>
      2. ‘관리자’는 ‘가입신청자’의 신청에 대해 ‘깨비 그룹웨어’ 이용을 승낙함을 원칙으로 합니다. 
      다만, ‘관리자’는 아래 각 호에 해당하는 신청자에 대해 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다. <br/>
      <div style={indentationStyle}>
        가. ‘가입신청자’가 이 약관에 의하여 이전에 ‘회원’ 자격을 상실한 적이 있는 경우. <br/>
        나. 실명이 아니거나 타인의 명의를 이용한 경우. <br/>
        다. 허위의 정보를 기재하거나, ‘회사’가 요청하는 필수적인 내용을 기재하지 않는 경우. <br/>
        라. 위법, 불법행위 등 부정한 용도로 ‘깨비 그룹웨어’를 이용하고자 하는 경우. <br/>
        마. ‘가입신청자’의 귀책사유로 인해 승인이 불가능하거나 기타 규정한 제반 사항을 위반하여 신청하는 경우. <br/>
      </div>
      3. 제1항의 회원가입 신청에 있어 ‘회사’는 전문기관을 통한 실명 확인 및 본인인증을 요청할 수 있습니다. <br/>
      4. ‘회사’는 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다. 
      이 경우 ‘회사’는 ‘가입신청자’에게 이 사실을 알립니다. <br/>
      5. ‘깨비 그룹웨어’ 이용계약의 성립 시기는 ‘관리자’가 회원가입 신청을 승인한 시점으로 합니다. <br/>
      6. ‘가입신청자’가 회원가입 신청 시 제공한 개인정보는 관련 법령 및 ‘회사’의 개인정보취급방침의 적용을 받습니다. <br/><br/>

      <b>제5조(정보의 변경)</b> <br/>
      1. ‘회사’는 스스로의 정보를 열람하고 수정할 수 있습니다. 다만, ‘깨비 그룹웨어’ 관리를 위해 필요한 
      ‘도메인’, ‘그룹명’ 등 ‘깨비’가 수정을 불허하는 항목의 수정은 ‘깨비’와 사전 합의가 필요합니다. <br/>
      2. ‘구성원’은 ‘깨비 그룹웨어’ 내 개인정보관리 화면을 통하여 자신의 정보를 수정할 수 있습니다. 
      다만 ‘깨비’ 또는 ‘회사’가 허용하지 않는 정보는 수정할 수 없습니다. <br/>
      3. ‘회사’는 변경한 정보에 대해 온라인으로 수정하거나 전자우편 등 기타 방법으로 ‘깨비’에 대해 
      그 변경사항을 알려야 합니다. 만약 이를 수행하지 않아 발생하는 불이익에 대해 ‘깨비’는 책임을 부담하지 않습니다. <br/><br/>

      <b>제6조(개인정보 보호 의무)</b> <br/>
      1. ‘회사’는 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관련 법령이 정하는 바에 따라 
      ‘구성원’의 개인정보를 보호하기 위해 노력합니다. <br/>
      2. 개인정보의 보호 및 사용에 대해서는 관련 법령 및 ‘회사’의 개인정보처리방침이 적용됩니다. <br/>
      3. ‘관리자’는 ‘일반 구성원’의 개인정보처리자로서 개인정보보호법 등 관련 법령이 정한 바에 따라 
      ‘일반 구성원’의 개인정보를 보호하여야 합니다. <br/><br/>

      <b>제7조(계정 정보 관리에 대한 의무)</b> <br/>
      1. ‘구성원’의 ‘아이디’와 ‘비밀번호’에 관한 관리 책임은 ‘구성원’ 본인에게 있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다. <br/>
      2. ‘관리자’는 ‘구성원’의 ‘아이디’ 또는 개인정보가 유출 우려가 있거나, 반사회적 또는 미풍양속에 
      어긋날 수 있는 경우, 해당 ‘아이디’의 이용을 제한할 수 있습니다. <br/>
      3. ‘구성원’은 ‘아이디’ 및 ‘비밀번호’가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 
      이를 즉시 ‘회사’ 또는 ‘관리자’에 통지하고 안내에 따라야 합니다. <br/><br/>

      <b>제8조(‘회사’에 대한 통지)</b> <br/>
      1. ‘깨비’가 ‘회사’에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 깨비 메일 전자우편 주소 
      또는 계 약시 등록한 보조 전자우편 주소로 합니다. <br/>
      2. ‘깨비’가 ‘관리자’에게 통지한 경우 이는 ‘회사’에게 통지한 것과 동일한 것으로 봅니다. <br/>
      3. ‘회사’ 전체에 대한 통지의 경우 ‘깨비’는 7일 이상 ‘서비스 홈페이지’ 게시판에 해당 내용을 
      게시함으로써 전항의 통지를 갈음할 수 있습니다. <br/>
      4. ‘회사’와 ‘관리자’는 ‘깨비’가 통지한 사항에 대해 ‘구성원’에게 통지할 책임을 부담합니다. <br/><br/>

      <b>제9조(‘깨비’의 의무)</b> <br/>
      1. ‘깨비’는 관련 법령과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 
      계속적이고 안정적으로 ‘깨비 그룹웨어’를 제공하기 위해 최선을 다하여 노력합니다. <br/>
      2. ‘깨비’는 ‘깨비 그룹웨어’ 이용과 관련하여 발생하는 ‘회사’의 불만 또는 피해 구제 요청을 적절하게 
      처리할 수 있도록 필요한 인력 및 시스템을 구비합니다. <br/>
      3. ‘깨비’는 ‘깨비 그룹웨어’ 이용과 관련하여 ‘회사’로부터 제기된 의견이나 불만이 정당하다고 
      인정할 경우에는 이를 처리하여야 합니다. <br/>
      4. ‘깨비’가 ‘회사’에 대한 ‘깨비 그룹웨어’의 제공이 불가능해지는 경우, ‘깨비’는 ‘깨비 그룹웨어’의 
      제공 중지 일자의 3개월 전까지 제8조에서 정한 방법으로 ‘회사’에게 통지합니다. 
      다만, ‘깨비’가 3개월 전에 통지할 수 없는 부득이한 사유가 있는 경우 ‘깨비’는 ‘깨비 그룹웨어’를 
      제공할 수 없게 된 날까지 ‘회사’에게 통지하는 것으로 3개월 전 통지의무를 갈음할 수 있습니다. <br/><br/>

      <b>제10조(‘구성원’의 의무)</b> <br/>
      1. ‘구성원은 아래 각 호의 행위를 하여서는 안 됩니다. <br/>
      <div style={indentationStyle}>
        가. 회원가입 신청 또는 기입 정보의 변경 시 허위 내용의 등록. <br/>
        나. 타인의 정보 도용. <br/>
        다. ‘회사’가 게시한 정보의 변경. <br/>
        라. 불법 소프트웨어 등 법령에서 금지하거나 ‘회사’가 공지사항 등을 통해 금지하는 소프트웨어 등 정보의 복제, 전송, 공유하는 행위. <br/>
        마. ‘깨비’ 및 ‘회사’, 기타 제3자의 저작권 등 지적재산권에 대한 침해. <br/>
        바. ‘깨비’ 및 ‘회사’, 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위. <br/>
        사. 외설, 폭력 등이 포함된 정보, 위법 행위에 해당하는 정보, 인종/국적/성별/정치적 색깔 등 
        차별로 이어지는 표현이 포함된 정보, 반사회적 내용이 포함된 정보, 타인에게 불쾌감을 주는 
        표현을 ‘깨비 그룹웨어’를 이용하여 복제, 전송, 방송, 공유하는 행위. <br/>
        아. ‘회사’의 동의 없이 영리를 목적으로 ‘깨비 그룹웨어’를 사용하는 행위. <br/>
        자. 기타 ‘깨비’ 및 ‘회사’가 불법적이거나 부당하다고 판단하는 행위. <br/>
      </div>
      2. ‘구성원’은 관련 법령, 이 약관, ‘깨비 그룹웨어’ 운영정책, ‘회사’가 공지한 주의사항 및 통지 사항 등을 준수하여야 합니다. <br/><br/>

      <br/>

      <b><u>[제2장] ‘깨비 그룹웨어’ 이용 일반</u></b> <br/>
      <b>제11조(‘깨비 그룹웨어’의 제공 등)</b> <br/>
      1. ‘회사’는 ‘깨비 그룹웨어’의 연중무휴, 1일 24시간 제공함을 원칙으로 합니다. <br/>
      2. ‘회사’는 교체 및 고장, 통신 두절, 보수 점검 등 운영상 서비스를 정지할 이유가 있는 경우 제공을 
      일시적으로 중단할 수 있습니다. 이 경우 제공이 중단되기 7일 전에 ‘구성원’에게 통지합니다. 
      다만, ‘회사’가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다. <br/>
      3. ‘깨비’는 제2항의 사유로 서비스 제공이 일시적으로 중단됨으로 인하여 ‘회사’가 입은 손해에 
      대해 보상합니다. 단, ‘깨비’가 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 않습니다. <br/><br/>

      <b>제12조(‘깨비 그룹웨어’의 변경)</b> <br/>
      1. ‘깨비’는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 ‘깨비 그룹웨어’의 전부 
      또는 일부를 변경할 수 있습니다. <br/>
      2. ‘깨비 그룹웨어’의 내용, 이용방법, 이용 시간, 이용금액에 변경이 있는 경우에는 변경 사유, 
      변경될 내용 및 제공 일자 등은 그 변경 전에 ‘서비스 홈페이지’에 게시해야 합니다. <br/>
      3. ‘회사’는 본 조에 의한 ‘깨비 그룹웨어’의 변경에 동의하지 않을 경우 ‘깨비 그룹웨어’ 이용계약을 해지할 수 있습니다. <br/><br/>

      <b>제13조(‘깨비 그룹웨어’ 정보 제공 및 안내)</b> <br/>
      1. ‘깨비’는 ‘회사’가 ‘깨비 그룹웨어’ 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편 등의 
      방법으로 ‘회사’에게 제공할 수 있습니다. <br/>
      2. 제1항의 정보를 전화 및 모사전송 기기에 의해 전송하려고 하는 경우에는 ‘회사’의 사전 동의를 받아서 전송합니다. <br/>
      3. ‘회사’는 ‘깨비 그룹웨어’와 관련하여 ‘깨비’가 게시 및 제공하는 게시물 또는 기타 정보를 
      변경, 수정, 제한하는 등의 조치를 취하지 않습니다. <br/><br/>

      <b>제14조(이용제한 등)</b> <br/>
      1. ‘깨비’는 ‘회사’ 또는 ‘구성원’이 약관을 위반하거나 다음과 같은 사항처럼 ‘회사’ 또는 ‘구성원’이 
      ‘깨비 그룹웨어’의 정상적인 운영을 방해한 경우, 경고, 일시정지 영구 이용정지 등으로 ‘회사’의 ‘깨비 그룹웨어’ 
      이용을 단계적으로 제한할 수 있습니다. <br/>
      <div style={indentationStyle}>
        가. 국익 또는 사회적 공익을 저해할 목적으로 이용되는 경우. <br/>
        나. 방송통신위원회 또는 한국인터넷진흥원이 스팸(불법 스팸 포함) 전송 사실을 확인하여 이용정지를 요청하는 경우. <br/>
        다. 국익 또는 사회적 공익을 저해할 목적으로 이용되는 경우. <br/>
        라. 방송통신위원회 또는 한국인터넷진흥원이 스팸(불법스팸 포함) 전송 사실을 확인하여 이용정지를 요청하는 경우. <br/>
        마. 서비스를 이용하여 전송되는 내용이 불법 통신에 해당되거나 음란하고 선정적인 사진이나 글 등을 전송하거나 
        범죄적 행위 및 미풍양속, 공공질서에 반하는 행위에 해당하는 경우. <br/>
        바. 다른 고객 또는 제3 자의 지적재산권을 침해하거나, 지적재산권자가 지적재산권 침해되었음을 주장할 수 있다고 판단되는 경우. <br/>
        사. 타인의 개인정보 유출, 비밀번호 도용 등의 부정한 행위를 한 경우나 타인의 명예를 손상시키거나 
        타인에게 불이익을 주는 행위를 한 경우. <br/>
        아. 불법선거운동과 관련하여 선거관리위원회로부터 유권해석을 받은 경우. <br/>
        자. 타인의 명의를 도용하여 가입하거나, 타인 예금 계좌나 신용카드를 도용한 경우. <br/>
        차. 타인의 개인정보 유출, 비밀번호 도용 등의 부정한 행위를 한 경우나 타인의 명예를 손상시키거나 타인에게 불이익을 주는 행위. <br/>
        카. 고의 또는 중대한 과실로 인한 프로그램의 오작동 등으로 서버의 중앙처리장치(CPU)와 메모리 점유율이 
        3%를 초과하도록 만드는 경우. <br/>
        타. 전산, 정보 기기의 오작동을 유발할 수 있는 컴퓨터 바이러스 프로그램을 유포하는 행위나 기타 네트워크 
        장애를 유발하는 행위를 한 경우. <br/>
        파. 고객의 서비스가 해킹되어 이용되거나 개인정보가 노출되어 서비스 품질을 저하시키는 경우. <br/>
        하. 안정된 서비스 운용을 저해할 수 있는 다량의 정보 전송 및 광고성 정보를 전송 또는 매개하는 행위를 한 경우. <br/>
        갸. 대량으로 스팸을 전송하여 시스템 및 네트워크 장애를 야기했거나 야기할 우려가 있는 경우. <br/>
        냐. 제공된 서비스가 스팸릴레이로 이용되거나 웜에 감염되어 스팸을 전송하는데 이용된 경우. <br/>
        댜. 해당 광고를 수신한 자가 수신거부를 요청하였으나 지속적으로 재전송한 경우. <br/>
        랴. 계정당 일일 400통 이상의 메일을 발송하거나 계정당 일일 200통 이상의 메일을 수신하는 경우. <br/>
        먀. 동일 계정으로 1분 이내에 100통 이상의 E-mail이 송, 수신되어 서비스 품질을 저하시키는 경우. <br/>
        뱌. 이 약관을 포함하여 기타 관련 법령이나 회사가 정한 이용조건에 위배되는 경우. <br/>
        샤. 규정에 의한 고객의 의무를 중대하게 위반한 경우. <br/>
        야. 서버의 중앙처리장치(CPU)와 메모리, 하드디스크(HDD)의 점유율이 3%를 초과하도록 하여 
        같은 서버를 이용하는 다른 고객에게 피해를 주는 경우. <br/>
      </div>
      2. 본 조에 따라 ‘깨비 그룹웨어’ 이용을 제한하거나 계약을 해지하는 경우에는 ‘깨비’는 이의신청 방법과 
      함께 제8조에 따라 통지합니다. <br/>
      3. ‘회사’는 본 조에 따른 이용 제한 등에 대해 ‘깨비’가 정한 절차에 따라 이의신청을 할 수 있습니다. 
      이때 이의가 정당하다고 ‘깨비’가 인정하는 경우 ‘깨비’는 즉시 ‘깨비 그룹웨어’의 이용을 재개합니다. <br/><br/>

      <br/>

      <b><u>[제3장] 기타</u></b> <br/>
      <b>제15조(재판권 및 준거법)</b> <br/>
      1. ‘깨비’와 ‘회사’ 간에 발생한 전자상거래 분쟁에 관한 소송은 제소 당시의 이용자의 주소에 의하고, 
      주소가 없는 경우에는 거소를 관할하는 지방법원의 전속관할로 합니다. 다만, 제소 당시 이용자의 주소 
      또는 거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의 관할법원에 제기합니다. <br/>
      2. ‘깨비’와 ‘회사’ 간에 제기된 전자상거래 소송에는 한국법을 적용합니다. <br/><br/>

      <b>제16조(스팸메일 및 스팸메시지의 전송제한 등)</b> <br/>
      1.  스팸이란 수신자의 의사와 상관없이 일방적으로 전송되는 불필요한 광고성 메일 또는 메시지를 말합니다. <br/>
      2. ‘깨비 그룹웨어’는 개인 간의 커뮤니케이션을 위해 메일 또는 메시지, 수신 동의 후 받은 메일 또는 메시지, 
      기업의 기업 활동을 위한 합법적인 커뮤니케이션 메일 또는 메시지 이외의 아래와 같은 경우 스팸으로 판단합니다. 
      스팸으로 판단되는 경우 해당 메일 또는 메시지를 차단하고, 스팸 발송자에 대해서는 메일 또는 메시지 서비스 이용을 제한할 수 있습니다. <br/>
      <div style={indentationStyle}>
        가. 정보통신망 이용촉진 및 정보보호에 관한 법률 등 관계법령 및 한국인터넷진흥원의 스팸메일 방지 가이드라인을 준수하지 않은 경우. <br/>
        나. 수신자의 동의 없이 대량으로 발송한 경우. <br/>
        다. 관리자 사칭 또는 허위사실 유포한 경우. <br/>
        라. 불특정 다수를 대상으로 발송되는 ‘대출’ 광고 또는 선전을 포함하는 경우. <br/>
        마. 음란성 글, 음란/불법 CD 및 프로그램을 판매하는 경우. <br/>
        바. 공포심 또는 불안감을 유발하는 연속성 메일 또는 메시지, 사기성 메일 또는 메시지. <br/>
        사. 스팸 신고가 일정 수치 이상이며, 내용이 객관적으로도 스팸인 경우. <br/>
      </div>
      3. ‘회사’는 스팸 차단시스템을 통해 스팸의 송수신에 대응하며, ‘서비스’에서 제공하는 스팸 신고를 통해 정보를 
      ‘깨비’에 제공함으로써 스팸 송수신 차단 서비스를 개선할 수 있습니다. <br/>
      4. ‘회사’는 ‘구성원’의 스팸메일 전송이 확인된 경우, 방송통신위원회 또는 한국인터넷진흥원이 불법 스팸 전송 사실을 
      확인하여 요청한 경우, ‘구성원’이 대량으로 스팸을 전송하여 시스템 장애를 야기했거나 야기할 우려가 있는 경우에는 
      제14조에 따라 이용 제한 등의 조치를 취할 수 있습니다. <br/> <br/>

      <b>제17조(손해배상)</b> <br/>
      1. ‘깨비’, ‘회사’ 귀책사유로 인해 상대방 또는 제3자에게 손해가 발생할 경우 귀책당사자는 
      해당 손해를 배상해야 합니다. ‘구성원’의 귀책사유는 ‘회사’의 귀책사유로 봅니다. <br/><br/>

      <b>제18조(서버 환경 지원 및 서비스 이전)</b> <br/>
      1. ‘깨비’는 ‘회사’가 정상적으로 서비스를 사용할 수 있도록 최적의 서버 환경을 지원해야 하지만 
      ‘회사’가 특별한 서버 환경을 요청하는 경우에는 ‘깨비’는 응하지 않습니다. 
      다만 별도의 계약에 의하여 ‘회사’와 합의한 경우는 예외로 합니다. <br/>
      2. 서비스를 타사로 이전하는 경우 네임서버의 캐시 (cache) 등으로 인하여 회사 측의 과실 없이 
      접속이 1~2일 정도 중단되더라도 이는 인터넷 환경의 특성이므로 ‘깨비’는 이에 대한 책임을 지지 아니 합니다. 
      또한 데이터 이전과 관련하여 기존에 사용하는 파일의 이전과 권한 설정 작업은 ‘회사’가 직접 하여야 합니다. <br/><br/>

    </React.Fragment>
  )
}


export const ContentForCollectingPersonalInfo = () => {
  return (
    <React.Fragment>

      OO 회사(이하 “회사”)는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법, 
      통신비밀보호법, 전기통신사업법 등 정보통신서비스제공자가 준수하여야 할 관련 법령상의 
      개인정보보호 규정을 준수하며, 관련 법령에 의거한 개인정보방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다. <br/><br/>

      <b>1. 수집하는 개인정보의 항목 및 수집방법</b> <br/>
      <b>가. 개인정보의 정의</b> <br/>
      현행 개인정보보호법 제2조에 따르면 개인정보의 정의는 아래와 같습니다. <br/>
      <div style={{display: "flex", justifyContent: "center"}}>
        <div style={{border: "1px solid rgb(15,21,74)", margin: "10px", padding: "4px", width: "90%"}}>
        1. “개인정보”란 살아 있는 개인에 관한 정보로서 다음 각 목의 어느 하나에 해당하는 정보를 말한다. <br/>
          <div style={indentationStyle}>
            가. 성명, 주민등록번호 및 영상 등을 통하여 개인을 알아볼 수 있는 정보 <br/>
            나. 해당 정보만으로는 특정 개인을 알아볼 수 없더라도 다른 정보와 쉽게 결합하여 알아볼 수 있는 정보. 
            이 경우 쉽게 결합할 수 있는지 여부는 다른 정보의 입수 가능성 등 개인을 알아보는 데 소요되는 시간, 비용, 기술 
            등을 합리적으로 고려하여야 한다. <br/>
            다. 가목 또는 나목을 제1호의2에 따라 가명처리함으로써 원래의 상태로 복원하기 위한 추가 정보의 사용 및 결합 없이는 
            특정 개인을 알아볼 수 없는 정보(이하 “가명정보”라 한다) <br/><br/>
            1의2. “가명처리”란 개인정보의 일부를 삭제하거나 일부 또는 전부를 대체하는 등의 방법으로 추가 정보가 
            없이는 특정 개인을 알아볼 수 없도록 처리하는 것을 말한다. <br/>
          </div>
        </div>
      </div>
      <br/>

      <b>나. 수집하는 개인정보의 항목</b> <br/>
      회사는 회원가입, 서비스 제공을 위해 아래와 같은 개인정보를 수집하고 있습니다. <br/>
      <div style={indentationStyle}>
        - 필수항목: 계정 정보(아이디, 비밀번호), 전화번호, 생년월일. <br/>
        - 선택항목: 이메일, 부서, 직책, 성별. <br/>
        아래의 정보도 수집되나, 이는 개인정보에 해당하지 않습니다. <br/>
        - 도메인 정보, 대표자명, 고유번호 등. <br/> <br/>
      </div>

      <b>다. 개인정보 수집방법</b> <br/>
      회사는 다음과 같은 방법으로 개인정보를 수집합니다. <br/>
      <div style={indentationStyle}>
        - 홈페이지, 서면 양식, 전화, 이메일, 생성 정보 수집 툴을 통한 수집. <br/><br/><br/>
      </div>


      <b>2. 개인정보의 수집 및 이용목적</b> <br/>
      <b>가. 회원관리</b> <br/>
      회원제 서비스 제공, 개인식별, 이용약관 위반 회원에 대한 이용 제한 조치, 서비스의 원활한 운영에 
      지장을 미치는 행위 및 서비스 부정이용 행위 제재, 가입 의사 확인, 가입 및 가입 횟수 제한, 분쟁 조정을 위한 
      기록 보존, 고지사항 전달, 회원 탈퇴 의사의 확인. <br/> <br/>

      <b>나. 신규 서비스 개발 및 마케팅 광고에의 활용</b> <br/>
      신규 서비스 개발 및 맞춤 서비스 제공, 통계학적 특성에 따른 서비스 제공 및 광고 게재, 
      서비스의 유효성 확인, 광고성 정보 제공, 접속 빈도 파악, 회원의 서비스 이용에 대한 통계. <br/><br/><br/>


      <b>3. 개인정보의 공유 및 제공</b> <br/>
      회사는 이용자들의 개인정보를 ‘2. 개인정보의 수집 및 이용목적’서 고지한 범위 내에서 사용하며, 
      이용자의 사전 동의 없이는 범위를 초과하여 이용하거나 이용자의 개인정보를 외부에 공개하지 않습니다. 
      다만, 아래의 경우에는 예외로 합니다. <br/>
      <div style={indentationStyle}>
        - 이용자가 사전에 동의한 경우. <br/>
        - 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우. <br/><br/><br/>
      </div>

      <b>4. 개인정보의 보유 및 이용기간</b> <br/>
      <b>가. 회사는 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. </b>
      단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간까지 보존합니다. <br/>
      <div style={indentationStyle}>
        - 고객 정보, 접속 IP 정보 및 서비스 이용 기록. <br/>
        보존 이유: 고객님의 탈퇴 기록 및 수사기관 등의 협조 등의 이용하기 위하여 보존함. <br/>
        보존 기간: 1년. <br/><br/>
      </div>

      <b>나. 상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계 법령의 규정에 따라 보존할 필요가 있는 경우 
      회사는 관계 법령에서 정한 일정한 기간 회원정보를 보관합니다. </b>
      이 경우 회사는 보관하는 정보를 그 보관의 목적으로만 이용하며 보존 기간은 아래와 같습니다. <br/>
      <div style={indentationStyle}>
        - 방문에 관한 기록: 3개월 (통신비밀보호법). <br/>
        - 본인확인에 관한 기록: 6개월 (정보통신망 이용촉진 및 정보보호 등에 관한 법률). <br/>
        - 소비자의 불만 또는 분쟁처리에 관한 기록: 3년 (전자상거래 등에서의 소비자보호에 관한 법률). <br/>
        - 계약 또는 청약철회 등에 관한 기록: 5년 (전자상거래 등에서의 소비자보호에 관한 법률). <br/>
        - 장부 및 영업과 관련된 중요 기록: 최소 10년 (상법). <br/><br/><br/>
      </div>


      <b>5. 개인정보 파기절차 및 방법</b> <br/>
      이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기되나, 
      해지의 경우 데이터 복구 요청 등 이용자의 보호를 위해 해지 후 7일간 보관되며, 7일이 지난 후 즉시 삭제됩니다. 
      회사의 개인정보 파기절차 및 방법은 다음과 같습니다. <br/><br/>

      <b>가. 파기절차</b> <br/>
      <div style={indentationStyle}>
        – 이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 데이터베이스로 옮겨져 
        내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라 일정 기간 저장된 후 파기됩니다. <br/><br/>
      </div>

      <b>나. 파기방법</b> <br/>
      <div style={indentationStyle}>
        – 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다. <br/><br/>
      </div>


      <b>6. 이용자의 권리와 그 행사방법</b> <br/>
      <div style={indentationStyle}>
        – 이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며, 회사의 개인정보의 
        처리에 동의하지 않는 경우 동의를 거부하거나 가입해지(회원 탈퇴)를 요청하실 수 있습니다. 
        다만, 그러한 경우 서비스의 일부 또는 전부 이용이 어려울 수 있습니다. <br/>
        – 이용자의 개인정보 조회, 수정을 위해서는 ‘개인정보 변경'(또는 ‘회원정보 수정’ 등)을, 
        가입해지(동의 철회)를 위해서는 ‘회원 탈퇴’를 클릭하여 직접 열람, 정정 또는 탈퇴가 가능합니다. <br/>
        – 혹은 개인정보보호책임자에게 서면, 전화 또는 이메일로 연락하시면 지체 없이 조치하겠습니다. <br/>
        – 이용자가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 
        개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 
        정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다. <br/>
        – 회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 
        ‘4. 개인정보의 보유 및 이용기간’에 명시된 바에 따라 처리하고 그 외의 다시 열람 
        또는 이용할 수 없도록 처리하고 있습니다. <br/><br/><br/>
      </div>


      <b>7. 개인정보 기술적/관리적 보호 대책</b> <br/>
      회사는 이용자들의 개인정보를 처리함에 있어 개인정보가 분실, 도난, 유출, 변조 또는 훼손되지 
      않도록 안전성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다. <br/><br/>

      <b>가. 비밀번호 암호화</b> <br/>
      이용자의 비밀번호는 암호화되어 저장 및 관리되고 있어 본인만이 알고 있으며, 개인정보의 
      확인 및 변경도 비밀번호를 알고 있는 본인에 의해서만 가능합니다. <br/><br/>

      <b>나. 해킹 등에 대비한 대책</b> <br/>
      개인정보의 훼손에 대비해서 자료를 수시로 백업하고 있고, 최신 백신 프로그램을 이용하여 
      이용자들의 개인정보나 자료가 유출되거나 손상되지 않도록 방지하고 있으며, 암호화 통신 등을 통하여 
      네트워크상에서 개인정보를 안전하게 전송할 수 있도록 하고 있습니다. 그리고 침입차단시스템을 
      이용하여 외부로부터의 무단 접근을 통제하고 있으며, 기타 시스템적으로 보안성을 확보하기 위한 
      가능한 모든 기술적 장치를 갖추려 노력하고 있습니다. <br/><br/>

      <b>다. 개인정보처리 직원의 최소화 및 교육</b> <br/>
      회사의 개인정보 관련 처리 직원은 담당자에 한정시키고 있고 이를 위한 별도의 비밀번호를 
      부여하여 정기적으로 갱신하고 있습니다. 담당자에 대한 수시 교육을 통하여 개인정보처리방침의 
      준수를 항상 강조하고 있습니다. <br/><br/>

      <b>라. 개인정보보호 전담기구의 운영</b> <br/>
      사내 개인정보보호 전담기구 등을 통하여 개인정보처리방침의 이행사항 및 담당자의 준수 여부를 
      확인하여 문제가 발견될 경우 즉시 수정하고 바로잡을 수 있도록 노력하고 있습니다. 단, 
      이용자 본인의 부주의나 인터넷상의 문제로 ID, 비밀번호 등 개인정보가 유출되어 발생한 
      문제에 대해 회사는 일체의 책임을 지지 않습니다. <br/><br/><br/>


      <b>8. 적용범위</b> <br/>
      깨비 그룹웨어에 링크되어 있는 다른 웹사이트들이 개인정보를 수집하는 행위에 대해서는 
      본 개인정보처리방침이 적용되지 않음을 알려 드립니다. 또한 본 개인정보처리방침은 
      깨비 그룹웨어에 회원가입한 구성원에 한해 적용됩니다. <br/>

      <br/>

    </React.Fragment>
  )
}


export const ContentForPromotion = () => {
  return (
    <React.Fragment>
      
      해당 약관에 동의하면 이벤트 등 광고성 정보가 가입 시 입력한 휴대폰의 이메일 또는 SMS로 전송됩니다.
      프로모션 수신에 관한 동의는 선택사항으로서, 이용자는 동의를 거부하더라도 회원 가입이 가능합니다.
      단, 동의를 거부할 경우 이벤트 등 광고성 정보의 이메일 또는 SMS 수신이 제한될 수 있습니다. <br/><br/>

      해당 약관은 회원가입이 완료된 이후에도 다시 동의하거나 동의 철회할 수 있습니다.

    </React.Fragment>
  )
}